Revit 2026 API

# XYZAngleOnPlaneTo Method

---

Returns the angle between this vector and the specified vector projected to the specified plane.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double AngleOnPlaneTo(
	XYZ right,
	XYZ normal
)
```
```vb
Public Function AngleOnPlaneTo (
	right As XYZ,
	normal As XYZ
) As Double
```
```cpp
public:
double AngleOnPlaneTo(
	XYZ^ right,
	XYZ^ normal
)
```
```fsharp
member AngleOnPlaneTo :
        right : XYZ *
        normal : XYZ -> float
```

#### Parameters

right XYZ
    The specified vector.
normal XYZ
    The normal vector that defines the plane.

#### Return Value

DoubleThe real number between 0 and 2*PI equal to the projected angle between the two vectors.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | Thrown when right or normal is . |

The angle is projected onto the plane orthogonal to the specified normal vector, counterclockwise with the normal pointing upwards.

#### Reference

XYZ Class

Autodesk.Revit.DB Namespace